<!DOCTYPE html><html lang="en"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>从一个愤青到自干五 | reStart</title><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/normalize/4.2.0/normalize.min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/0.6.0/pure-min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/0.6.0/grids-responsive-min.css"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.6.3/css/font-awesome.min.css"><script type="text/javascript" src="//cdn.bootcss.com/jquery/3.0.0/jquery.min.js"></script><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">从一个愤青到自干五</h1><a id="logo" href="/.">reStart</a><p class="description">再出发</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> Home</i></a><a href="/archives/"><i class="fa fa-archive"> Archive</i></a><a href="/about/"><i class="fa fa-user"> About</i></a><a href="/atom.xml"><i class="fa fa-rss"> RSS</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">从一个愤青到自干五</h1><div class="post-meta">Dec 24, 2013<span> | </span><span class="category"><a href="/categories/政治与社会/">政治与社会</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><div class="post-content"><p>&#x7EC8;&#x4E8E;&#x81EA;&#x5DF1;&#x642D;&#x5EFA;&#x4E86;&#x4E2A;blog&#xFF0C;&#x7B2C;&#x4E00;&#x7BC7;&#x535A;&#x5BA2;&#x8981;&#x5199;&#x70B9;&#x4EC0;&#x4E48;&#x5462;&#xFF0C;&#x8FD9;&#x4E48;&#x6709;&#x610F;&#x4E49;&#x7684;&#x5F00;&#x59CB;&#xFF0C;&#x8FD8;&#x662F;&#x732E;&#x7ED9;&#x4F1F;&#x5927;&#x7684;&#x7956;&#x56FD;&#x5427;&#x3002;</p>
<p>&#x8BB0;&#x7684;&#x521A;&#x6BD5;&#x4E1A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x559C;&#x6B22;&#x8BF4;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x201C;&#x4E0A;&#x5B66;&#x7684;&#x65F6;&#x5019;&#x89C9;&#x7740;&#x81EA;&#x5DF1;&#x662F;&#x5929;&#x4E4B;&#x9A84;&#x5B50;&#xFF0C;&#x6BD5;&#x4E1A;&#x4E4B;&#x540E;&#x624D;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x60B2;&#x50AC;&#x7684;&#x8981;&#x6B7B;&#x201D;&#x3002;&#x4EE5;&#x6B64;&#x6765;&#x5F00;&#x59CB;&#x6211;&#x5BF9;&#x793E;&#x4F1A;&#x73B0;&#x72B6;&#x4E0D;&#x6EE1;&#x7684;&#x53D1;&#x6CC4;&#x3002;&#x505A;&#x4E3A;&#x6FC0;&#x8FDB;&#x7684;&#x6124;&#x9752;&#xFF0C;&#x5BF9;&#x515A;&#x7684;&#x8150;&#x8D25;&#xFF0C;&#x6DF1;&#x6076;&#x75DB;&#x7EDD;&#xFF0C;&#x770B;&#x5230;&#x5B98;&#x4E8C;&#x4EE3;&#x548C;&#x5BCC;&#x4E8C;&#x4EE3;&#x4EEC;&#x7684;&#x5962;&#x4F88;&#x751F;&#x6D3B;&#xFF0C;&#x5927;&#x611F;&#x5E73;&#x6C11;&#x7684;&#x4E0A;&#x5347;&#x901A;&#x9053;&#x57FA;&#x672C;&#x88AB;&#x5835;&#x6B7B;&#x3002;&#x5F53;&#x5728;&#x7F8E;&#x5E1D;&#x5EA6;&#x8FC7;&#x4E86;&#x7F8E;&#x597D;&#x7684;1&#x4E2A;&#x6708;&#x540E;&#xFF0C;&#x66F4;&#x52A0;&#x611F;&#x5230;&#x81EA;&#x5DF1;&#x751F;&#x6D3B;&#x5728;&#x6C34;&#x6DF1;&#x706B;&#x70ED;&#x4E4B;&#x4E2D;&#x3002;&#x7F8E;&#x56FD;&#x7684;&#x6C34;&#x662F;&#x90A3;&#x4E48;&#x7684;&#x6E05;&#x6F88;&#xFF0C;&#x7A7A;&#x6C14;&#x662F;&#x90A3;&#x6837;&#x7684;&#x6E05;&#x65B0;&#xFF0C;&#x5728;&#x6C34;&#x65CF;&#x9986;&#x770B;&#x9C7C;&#xFF0C;&#x53EF;&#x4EE5;&#x6162;&#x6162;&#x7684;&#x6B23;&#x8D4F;&#xFF0C;&#x4E0D;&#x7528;&#x5728;&#x4EBA;&#x6F6E;&#x4E0B;&#x8D70;&#x9A6C;&#x89C2;&#x82B1;&#x3002;&#x4EBA;&#x4EEC;&#x4E0D;&#x7528;&#x4F4F;&#x5728;&#x62E5;&#x5835;&#x7684;&#x57CE;&#x5E02;&#xFF0C;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x98DF;&#x54C1;&#x5B89;&#x5168;&#xFF0C;&#x4E70;&#x8F66;&#x4E5F;&#x4E0D;&#x7528;&#x4EA4;&#x91CD;&#x7A0E;&#x3002;&#x603B;&#x4E4B;&#xFF0C;&#x56FD;&#x5916;&#x7684;&#x6708;&#x4EAE;&#x90FD;&#x6BD4;&#x56FD;&#x5185;&#x7684;&#x5706;&#x3002;&#x4E2D;&#x56FD;&#x4EBA;&#x6C11;&#x9762;&#x4E34;&#x7740;&#x65B0;&#x7684;&#x4E09;&#x5EA7;&#x5927;&#x5C71;&#xFF0C;&#x623F;&#x5B50;&#xFF0C;&#x533B;&#x7597;&#xFF0C;&#x6559;&#x80B2;&#x3002;&#x5728;&#x5317;&#x4EAC;&#x8FD9;&#x4E2A;&#x5168;&#x56FD;&#x4EBA;&#x6C11;&#x90FD;&#x6765;&#x4E70;&#x623F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x60F3;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x623F;&#x5B50;&#xFF0C;&#x96BE;&#xFF1B;&#x60F3;&#x751F;&#x4E2A;&#x5B69;&#x5B50;&#x6709;&#x6237;&#x53E3;&#xFF0C;&#x5728;&#x5317;&#x4EAC;&#x4E0A;&#x5B66;&#xFF0C;&#x9AD8;&#x8003;&#xFF0C;&#x96BE;&#xFF1B;&#x60F3;&#x4E0A;&#x4E0B;&#x73ED;&#x4E0D;&#x90A3;&#x4E48;&#x7D2F;&#x4E0D;&#x90A3;&#x4E48;&#x6324;&#xFF0C;&#x96BE;&#x3002;&#x5728;&#x8FD9;&#x4E48;&#x591A;&#x56F0;&#x96BE;&#x4E0B;&#xFF0C;&#x6211;&#x60F3;&#x53BB;&#x7F8E;&#x5E1D;&#x751F;&#x6D3B;&#x7684;&#x60F3;&#x6CD5;&#x840C;&#x53D1;&#x4E86;&#xFF0C;&#x4E5F;&#x6E10;&#x6E10;&#x8301;&#x58EE;&#xFF0C;&#x4E5F;&#x8BB8;&#x6211;&#x672A;&#x6765;&#x771F;&#x7684;&#x4F1A;&#x53BB;&#x7F8E;&#x5E1D;&#x751F;&#x6D3B;&#x3002;&#x4F46;&#x6211;&#x73B0;&#x5728;&#x6562;&#x8BF4;&#xFF0C;&#x6211;&#x7231;&#x751F;&#x6211;&#x517B;&#x6211;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x56FD;&#x5BB6;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x515A;&#x3002;</p>
<p>&#x5728;&#x5927;&#x5B66;&#x4E0A;&#x5B66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8D1F;&#x8D23;&#x7EF4;&#x62A4;&#x5B66;&#x6821;&#x7684;&#x8BBA;&#x575B;&#xFF0C;&#x6BCF;&#x5F53;&#x6709;&#x5B66;&#x751F;&#x53D1;&#x4E2A;&#x7565;&#x6709;&#x653F;&#x6CBB;&#x654F;&#x611F;&#x6027;&#x7684;&#x5E16;&#x5B50;&#xFF0C;&#x603B;&#x4F1A;&#x62DB;&#x6765;&#x7F51;&#x8B66;&#x7684;&#x8B66;&#x544A;&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x624B;&#x52A8;&#x8FC7;&#x6EE4;&#x6240;&#x6709;&#x7684;&#x5E16;&#x5B50;&#xFF0C;&#x5220;&#x9664;&#x4E0D;&#x826F;&#x4FE1;&#x606F;&#x3002;&#x5F53;&#x65F6;&#x5F88;&#x53CD;&#x611F;&#xFF0C;&#x89C9;&#x7740;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x5411;&#x7F8E;&#x5E1D;&#x4E00;&#x6837;&#x6C11;&#x4E3B;&#xFF0C;&#x81EA;&#x7531;&#x3002;&#x4E0A;&#x7F51;&#x4E0D;&#x7528;&#x7FFB;&#x5899;&#xFF0C;&#x53EF;&#x4EE5;&#x60F3;&#x8BF4;&#x6211;&#x4EEC;&#x4EFB;&#x610F;&#x60F3;&#x8BF4;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x6CC4;&#x5BF9;&#x515A;&#x548C;&#x653F;&#x5E9C;&#x7684;&#x4E0D;&#x6EE1;&#x3002;&#x5F53;&#x7136;&#x6211;&#x8FF7;&#x4E0A;&#x4E86;&#x7FFB;&#x5899;&#xFF0C;&#x770B;&#x5230;&#x4E86;&#x5916;&#x9762;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x611F;&#x89C9;&#x5F88;&#x65B0;&#x9C9C;&#x3002;&#x4E00;&#x51FA;&#x53BB;&#x81EA;&#x7136;&#x8981;&#x53BB;&#x770B;&#x770B;&#x90A3;&#x4E9B;&#x653F;&#x5E9C;&#x4E0D;&#x8BA9;&#x6211;&#x4EEC;&#x89E6;&#x78B0;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5927;&#x7EAA;&#x5143;&#x7B49;&#x7F51;&#x7AD9;&#x5C31;&#x6210;&#x4E86;&#x6211;&#x5E38;&#x53BB;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x66F4;&#x52A0;&#x8BA9;&#x6211;&#x5BF9;&#x515A;&#x7684;&#x8150;&#x8D25;&#x6DF1;&#x6076;&#x75DB;&#x7EDD;&#x3002;&#x53EA;&#x662F;&#x56E0;&#x4E3A;&#x67D0;&#x4EBA;&#x662F;&#x67D0;&#x4EBA;&#x7684;&#x513F;&#x5B50;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8863;&#x98DF;&#x65E0;&#x5FE7;&#xFF0C;&#x5927;&#x8086;&#x655B;&#x8D22;&#x3002;&#x60F3;&#x4E3A;&#x4EC0;&#x4E48;&#x5F53;&#x5B98;&#x7684;&#x5B69;&#x5B50;&#x8FD8;&#x5F53;&#x5B98;&#xFF0C;&#x800C;&#x8001;&#x767E;&#x59D3;&#x60F3;&#x8003;&#x4E2A;&#x516C;&#x52A1;&#x5458;&#x8FD9;&#x4E48;&#x96BE;&#x3002;</p>
<p>&#x5728;&#x6211;&#x95F2;&#x4E0B;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x559C;&#x6B22;&#x770B;&#x65B0;&#x95FB;&#x7684;&#x6211;&#xFF0C;&#x5076;&#x7136;&#x63A5;&#x89E6;&#x5230;&#x4E86;&#x5370;&#x5EA6;&#x65B0;&#x95FB;&#xFF0C;&#x4E5F;&#x8BD5;&#x56FE;&#x662F;&#x4E86;&#x89E3;&#x5370;&#x5EA6;&#x7684;&#x4E00;&#x4E89;&#xFF0C;&#x624D;&#x53D1;&#x73B0;&#xFF0C;&#x6C11;&#x4E3B;&#x4E0D;&#x662F;&#x4E07;&#x7075;&#x4E39;&#x3002;&#x770B;&#x5230;&#x53F0;&#x6E7E;&#x7684;&#x653F;&#x6CBB;&#x4E71;&#x8C61;&#xFF0C;&#x624D;&#x77E5;&#x9053;&#x6C11;&#x4E3B;&#x6709;&#x65F6;&#x5019;&#x4E5F;&#x662F;&#x963B;&#x788D;&#x3002;&#x4E00;&#x4E2A;&#x5076;&#x7136;&#x7684;&#x673A;&#x4F1A;&#x770B;&#x5230;&#x4E86;www.santaihu.com&#x4ECE;&#x800C;&#x63A5;&#x89E6;&#x5230;ccnovel.com&#xFF0C;&#x90A3;&#x5E74;&#x90A3;&#x5154;&#x90A3;&#x4E9B;&#x4E8B;&#xFF0C;&#x5929;&#x6DAF;&#x56FD;&#x9645;&#x89C2;&#x5BDF;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x7F51;&#x7AD9;&#xFF0C;&#x6211;&#x4E86;&#x89E3;&#x4E86;&#x5F88;&#x591A;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x56FD;&#x5BB6;&#x5728;&#x88AB;&#x4EBA;&#x5C01;&#x9501;&#x538B;&#x5236;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53D1;&#x5C55;&#x58EE;&#x5927;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E86;&#x4E0D;&#x8D77;&#x7684;&#x6210;&#x5C31;&#xFF0C;&#x515A;&#x5728;&#x7ECF;&#x6D4E;&#x4E0A;&#x7684;&#x6210;&#x5C31;&#x6211;&#x4E0D;&#x6562;&#x8BF4;&#x524D;&#x65E0;&#x53E4;&#x4EBA;&#xFF0C;&#x540E;&#x65E0;&#x6765;&#x8005;&#xFF0C;&#x4F46;&#x81F3;&#x5C11;&#x662F;&#x4E00;&#x4E2A;&#x5947;&#x8FF9;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x5947;&#x8FF9;&#x4E0D;&#x662F;&#x53D1;&#x751F;&#x5728;&#x6C11;&#x4E3B;&#x7684;&#x5370;&#x5EA6;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x96C6;&#x4F53;&#x9886;&#x5BFC;&#x7684;&#x4E2D;&#x56FD;&#x3002;&#x897F;&#x65B9;&#x56FD;&#x5BB6;&#x603B;&#x662F;&#x9F13;&#x5439;&#x5370;&#x5EA6;&#x4F1A;&#x8D85;&#x8D8A;&#x4E2D;&#x56FD;&#xFF0C;&#x4EE5;&#x8BC1;&#x660E;&#x6C11;&#x4E3B;&#x7684;&#x4F18;&#x8D8A;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x65E0;&#x5948;&#x5370;&#x5EA6;&#x592A;&#x4E0D;&#x4E89;&#x6C14;&#x3002;</p>
<p>&#x6C11;&#x4E3B;&#x6709;&#x5F88;&#x591A;&#x5F0A;&#x7AEF;&#xFF0C;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x53D8;&#x6210;&#x6C11;&#x7CB9;&#x3002;</p>
<p>&#x6C11;&#x4E3B;&#x5BFC;&#x81F4;&#x653F;&#x515A;&#x4E3A;&#x4E86;&#x9009;&#x4E3E;&#x8FC7;&#x4EFD;&#x8BB8;&#x8BFA;&#x793E;&#x4F1A;&#x798F;&#x5229;&#xFF0C;&#x52A0;&#x5927;&#x56FD;&#x5BB6;&#x8D1F;&#x62C5;&#x3002;&#x793E;&#x4F1A;&#x798F;&#x5229;&#x8981;&#x91CF;&#x529B;&#x800C;&#x884C;&#xFF0C;&#x4E0D;&#x80FD;&#x8D85;&#x8FC7;&#x653F;&#x5E9C;&#x7684;&#x627F;&#x53D7;&#x6781;&#x9650;&#xFF0C;&#x5426;&#x5219;&#x56FD;&#x5BB6;&#x8D22;&#x653F;&#x4E00;&#x76F4;&#x8D64;&#x5B57;&#xFF0C;&#x65E9;&#x665A;&#x4F1A;&#x50CF;&#x6B27;&#x732A;&#x56DB;&#x56FD;&#x4E00;&#x6837;&#x7206;&#x53D1;&#x503A;&#x52A1;&#x5371;&#x673A;&#x3002;&#x6211;&#x652F;&#x6301;&#x533B;&#x7597;&#x4FDD;&#x9669;&#xFF0C;&#x4F46;&#x4E0D;&#x652F;&#x6301;&#x5168;&#x6C11;&#x514D;&#x8D39;&#x533B;&#x7597;&#x3002;&#x56FD;&#x5BB6;&#x8981;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x8D44;&#x6E90;&#x53D1;&#x5C55;&#x81EA;&#x5DF1;&#xFF0C;&#x628A;&#x6240;&#x6709;&#x7684;&#x8D44;&#x6E90;&#x90FD;&#x6295;&#x5165;&#x5230;&#x798F;&#x5229;&#x4E2D;&#xFF0C;&#x56FD;&#x5BB6;&#x5F97;&#x4E0D;&#x5230;&#x53D1;&#x5C55;&#xFF0C;&#x56FD;&#x5BB6;&#x5B9E;&#x529B;&#x5F97;&#x4E0D;&#x5230;&#x589E;&#x5F3A;&#xFF0C;&#x5230;&#x5934;&#x6765;&#x8FD8;&#x662F;&#x8981;&#x8001;&#x767E;&#x59D3;&#x6765;&#x4E70;&#x5355;&#x3002;</p>
<p>&#x6C11;&#x4E3B;&#x6709;&#x65F6;&#x5019;&#x5BFC;&#x81F4;&#x884C;&#x653F;&#x6548;&#x7387;&#x4F4E;&#x4E0B;&#xFF0C;&#x751A;&#x81F3;&#x884C;&#x653F;&#x762B;&#x75EA;&#x3002;&#x5C31;&#x6211;&#x8BA4;&#x4E3A;&#xFF0C;&#x6C11;&#x4E3B;&#x5E94;&#x8BE5;&#x662F;&#x5C11;&#x6570;&#x670D;&#x4ECE;&#x591A;&#x6570;&#xFF0C;&#x591A;&#x6570;&#x5C0A;&#x91CD;&#x5C11;&#x6570;&#x3002;&#x4F46;&#x662F;&#x5728;&#x6C11;&#x7CB9;&#x76DB;&#x884C;&#x7684;&#x793E;&#x4F1A;&#xFF0C;&#x5C11;&#x6570;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x7ED1;&#x67B6;&#x4E86;&#x591A;&#x6570;&#x3002;&#x4EE5;&#x9009;&#x7968;&#x4E3A;&#x76EE;&#x7684;&#x7684;&#x653F;&#x6CBB;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x5BFC;&#x81F4;&#x653F;&#x6CBB;&#x4EBA;&#x7269;&#x559C;&#x6B22;&#x4E3A;&#x5F31;&#x52BF;&#x7684;&#x5C11;&#x6570;&#x53D1;&#x58F0;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x5FFD;&#x7565;&#x4E86;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x7684;&#x5229;&#x76CA;&#x3002;&#x800C;&#x4E14;&#x4EBA;&#x90FD;&#x662F;&#x81EA;&#x79C1;&#x7684;&#xFF0C;&#x90FD;&#x53EA;&#x662F;&#x8003;&#x8651;&#x81EA;&#x5DF1;&#x7684;&#x5229;&#x76CA;&#xFF0C;&#x56FD;&#x5BB6;&#x7684;&#x5229;&#x76CA;&#x603B;&#x662F;&#x5176;&#x6B21;&#x3002;&#x5F53;&#x56FD;&#x5BB6;&#x5229;&#x76CA;&#x548C;&#x5C11;&#x6570;&#x4EBA;&#x5229;&#x76CA;&#x6709;&#x51B2;&#x7A81;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x5C31;&#x5E94;&#x8BE5;&#x505A;&#x51FA;&#x727A;&#x7272;&#x3002;&#x5728;&#x53F0;&#x6E7E;&#xFF0C;&#x4EBA;&#x4EEC;&#x4E0D;&#x8BA9;&#x5EFA;&#x706B;&#x529B;&#x53D1;&#x7535;&#xFF0C;&#x98CE;&#x529B;&#x53D1;&#x7535;&#xFF0C;&#x6838;&#x80FD;&#x53D1;&#x7535;&#xFF0C;&#x8BF4;&#x5BF9;&#x73AF;&#x5883;&#x4E0D;&#x597D;&#xFF0C;&#x4E0D;&#x8BA9;&#x5728;&#x81EA;&#x5DF1;&#x5BB6;&#x9644;&#x8FD1;&#x5EFA;&#xFF0C;&#x4F46;&#x662F;&#x53C8;&#x8981;&#x56FD;&#x5BB6;&#x4E0D;&#x6DA8;&#x7535;&#x4EF7;&#x3002;&#x8FD9;&#x771F;&#x662F;&#x53C8;&#x8BA9;&#x9A6C;&#x513F;&#x8DD1;&#x53C8;&#x8BA9;&#x9A6C;&#x513F;&#x4E0D;&#x5403;&#x8349;&#x3002;&#x5F53;&#x521D;&#x542C;&#x5230;&#x6E2F;&#x73E0;&#x6FB3;&#x5927;&#x6865;&#x56E0;&#x4E3A;&#x9999;&#x6E2F;&#x5927;&#x5988;&#x7533;&#x8BC9;&#x800C;&#x505C;&#x5DE5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x8FD8;&#x6B22;&#x547C;&#x96C0;&#x8DC3;&#xFF0C;&#x8BF4;&#x5185;&#x5730;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4E5F;&#x80FD;&#x8FD9;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x660E;&#x663E;&#x5BF9;&#x9999;&#x6E2F;&#x7ECF;&#x6D4E;&#x53D1;&#x5C55;&#x6709;&#x5229;&#x7684;&#x91CD;&#x5927;&#x5EFA;&#x8BBE;&#x88AB;&#x8FEB;&#x505C;&#x5DE5;&#xFF0C;&#x6D6A;&#x8D39;&#x7684;&#x662F;&#x5168;&#x6C11;&#x7684;&#x7EB3;&#x7A0E;&#x94B1;&#xFF0C;&#x6D6A;&#x8D39;&#x7684;&#x662F;&#x5168;&#x9999;&#x6E2F;&#x7684;&#x53D1;&#x5C55;&#x673A;&#x4F1A;&#x3002;&#x53F0;&#x6E7E;&#x56E0;&#x4E3A;&#x84DD;&#x7EFF;&#x5BF9;&#x5CD9;&#xFF0C;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x8D38;&#x6613;&#x534F;&#x5B9A;&#xFF0C;&#x5927;&#x9646;&#x660E;&#x663E;&#x8BA9;&#x5229;&#xFF0C;&#x7ED3;&#x679C;&#x8FD8;&#x662F;&#x5361;&#x5728;&#x7ACB;&#x6CD5;&#x9662;&#xFF0C;&#x8FDF;&#x8FDF;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x3002;&#x6C11;&#x4E3B;&#x653F;&#x6CBB;&#x662F;&#x8981;&#x9760;&#x4EBA;&#x6C11;&#x7D20;&#x517B;&#x7684;&#xFF0C;&#x9009;&#x7968;&#x653F;&#x6CBB;&#x5E76;&#x4E0D;&#x662F;&#x6C11;&#x4E3B;&#x3002;</p>
<p>&#x4EBA;&#x6C11;&#x90FD;&#x662F;&#x77ED;&#x89C6;&#x7684;&#xFF0C;&#x4EBA;&#x6C11;&#x90FD;&#x662F;&#x5BB9;&#x6613;&#x88AB;&#x8206;&#x8BBA;&#x5BFC;&#x5411;&#x6240;&#x5F71;&#x54CD;&#x7684;&#x3002;&#x5168;&#x6C11;&#x62E5;&#x62A4;&#x7684;&#x51B3;&#x7B56;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x6700;&#x597D;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x624D;&#x8981;&#x6709;&#x653F;&#x6CBB;&#x5BB6;&#x7684;&#x9AD8;&#x77BB;&#x8FDC;&#x77A9;&#x3002;&#x5F53;&#x515A;&#x7684;&#x7B2C;&#x4E00;&#x4EE3;&#x9886;&#x5BFC;&#x4EBA;&#x641E;&#x4E24;&#x5F39;&#x4E00;&#x661F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x56FD;&#x5BB6;&#x4E00;&#x7A77;&#x4E8C;&#x767D;&#xFF0C;&#x6CA1;&#x6709;&#x6218;&#x7565;&#x7684;&#x773C;&#x5149;&#x600E;&#x80FD;&#x4E0B;&#x8FD9;&#x6837;&#x7684;&#x51B3;&#x5FC3;&#x3002;&#x5F53;&#x9093;&#x5C0F;&#x5E73;&#x6539;&#x9769;&#x5F00;&#x653E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x8C01;&#x80FD;&#x60F3;&#x5230;&#x4F1A;&#x6709;&#x4ECA;&#x5929;&#x7684;&#x6210;&#x7EE9;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x9886;&#x5BFC;&#x4EBA;&#x90FD;&#x662F;&#x7ECF;&#x5386;&#x8FC7;&#x5404;&#x79CD;&#x5386;&#x7EC3;&#x7684;&#x4EBA;&#x7CBE;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x773C;&#x5149;&#x548C;&#x8C0B;&#x7565;&#x5B9A;&#x4F1A;&#x6BD4;&#x6211;&#x4EEC;&#x8981;&#x5F3A;&#x7684;&#x591A;&#xFF0C;&#x76F8;&#x4FE1;&#x4ED6;&#x4EEC;&#xFF0C;&#x5B9A;&#x80FD;&#x505A;&#x51FA;&#x6700;&#x6709;&#x5229;&#x4E8E;&#x56FD;&#x5BB6;&#x7684;&#x51B3;&#x7B56;&#x3002;&#x6C11;&#x65CF;&#x4E3B;&#x4E49;&#x8005;&#x603B;&#x8BF4;&#x56FD;&#x5BB6;&#x592A;&#x8F6F;&#xFF0C;&#x9EC4;&#x5CA9;&#x5C9B;&#x4E8B;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x603B;&#x662F;&#x5728;&#x8BF4;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x6253;&#x8FC7;&#x53BB;&#xFF0C;&#x8F6F;&#x86CB;&#x3002;&#x4F46;&#x662F;&#x7ECF;&#x8FC7;&#x4E00;&#x5E74;&#x7684;&#x62C9;&#x952F;&#x6218;&#xFF0C;&#x9EC4;&#x5CA9;&#x5C9B;&#x8FD8;&#x4E0D;&#x662F;&#x7262;&#x7262;&#x7684;&#x63A7;&#x5236;&#x5728;&#x6211;&#x4EEC;&#x624B;&#x4E2D;&#x3002;&#x56FD;&#x5BB6;&#x8981;&#x53D1;&#x5C55;&#x5C31;&#x79BB;&#x4E0D;&#x5F00;&#x548C;&#x5E73;&#x7A33;&#x5B9A;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x56FD;&#x5BB6;&#x7684;&#x5B9E;&#x529B;&#x5728;&#x589E;&#x5F3A;&#xFF0C;&#x7F8E;&#x5E1D;&#x7684;&#x5B9E;&#x529B;&#x5728;&#x51CF;&#x5F31;&#xFF0C;&#x65F6;&#x95F4;&#x662F;&#x7AD9;&#x5728;&#x6211;&#x4EEC;&#x8FD9;&#x8FB9;&#x7684;&#x3002;</p>
<p>&#x5404;&#x79CD;&#x6124;&#x9752;&#xFF0C;&#x5E26;&#x8DEF;&#x515A;&#x4EEC;&#xFF0C;&#x53EA;&#x6709;&#x4E2D;&#x56FD;&#x5F3A;&#x5927;&#xFF0C;&#x4E2D;&#x56FD;&#x4EBA;&#x624D;&#x6709;&#x5C0A;&#x4E25;&#xFF0C;&#x544A;&#x522B;&#x90A3;&#x4E2A;&#x534E;&#x4EBA;&#x4E0E;&#x72D7;&#x4E0D;&#x5F97;&#x5165;&#x5185;&#x7684;&#x65F6;&#x4EE3;&#x3002;&#x6211;&#x89C9;&#x7740;&#x8D8A;&#x662F;&#x5728;&#x56FD;&#x5916;&#x7684;&#x534E;&#x4EBA;&#x8D8A;&#x80FD;&#x611F;&#x53D7;&#x5230;&#x56FD;&#x5BB6;&#x5F3A;&#x5927;&#x7ED9;&#x4EBA;&#x4EEC;&#x5E26;&#x6765;&#x7684;&#x8363;&#x8000;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x4EC0;&#x4E48;&#x56FD;&#x7C4D;&#xFF0C;&#x6C38;&#x8FDC;&#x662F;&#x534E;&#x590F;&#x5B50;&#x5B59;&#x3002;&#x5F53;&#x6392;&#x534E;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x522B;&#x4EBA;&#x53EF;&#x4E0D;&#x7BA1;&#x4F60;&#x662F;&#x4E0D;&#x662F;&#x5370;&#x5C3C;&#x56FD;&#x7C4D;&#x3002;&#x534E;&#x4EBA;&#x7684;&#x6D77;&#x5916;&#x5730;&#x4F4D;&#x4E5F;&#x6C38;&#x8FDC;&#x79BB;&#x4E0D;&#x5F00;&#x4E2D;&#x56FD;&#x7684;&#x56FD;&#x9645;&#x5730;&#x4F4D;&#x3002;&#x7F8E;&#x56FD;ABC&#x8FB1;&#x534E;&#x4F1A;&#x56E0;&#x4E3A;&#x534E;&#x4EBA;&#x7684;&#x6297;&#x8BAE;&#x800C;&#x9053;&#x6B49;&#xFF0C;&#x5168;&#x662F;&#x56E0;&#x4E3A;&#x534E;&#x4EBA;&#x7684;&#x56E2;&#x7ED3;&#xFF0C;&#x5BF9;&#x7956;&#x56FD;&#x7684;&#x70ED;&#x7231;&#x53CA;&#x4E2D;&#x56FD;&#x7684;&#x5F3A;&#x5927;&#x3002;</p>
<p>&#x5E0C;&#x671B;&#x90A3;&#x4E9B;&#x5BF9;&#x56FD;&#x5BB6;&#x4E0D;&#x6EE1;&#x7684;&#x4EBA;&#xFF0C;&#x4E0D;&#x8981;&#x603B;&#x662F;&#x770B;&#x5230;&#x793E;&#x4F1A;&#x4E0D;&#x597D;&#x7684;&#x4E00;&#x9762;&#xFF0C;&#x56FD;&#x5BB6;&#x8FD9;&#x4E48;&#x5927;&#xFF0C;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x90FD;&#x4F1A;&#x53D1;&#x751F;&#xFF0C;&#x591A;&#x770B;&#x770B;&#x597D;&#x7684;&#x4E00;&#x9762;&#xFF0C;&#x4F1A;&#x8BA9;&#x6211;&#x4EEC;&#x6D3B;&#x7684;&#x66F4;&#x52A0;&#x5F00;&#x5FC3;&#x3002;&#x56FD;&#x5BB6;&#x5728;&#x53D1;&#x5C55;&#xFF0C;&#x56FD;&#x5BB6;&#x5728;&#x7ED9;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#xFF0C;&#x8DDF;&#x4E16;&#x754C;&#x4E0A;&#x5927;&#x591A;&#x6570;&#x56FD;&#x5BB6;&#x76F8;&#x6BD4;&#xFF0C;&#x505A;&#x4E3A;&#x4E2D;&#x56FD;&#x7684;&#x56FD;&#x6C11;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x65E0;&#x6BD4;&#x5E78;&#x798F;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x4E2D;&#x56FD;&#x7EC8;&#x5C06;&#x4F1A;&#x6210;&#x4E3A;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x5F3A;&#x5927;&#x7684;&#x56FD;&#x5BB6;&#x3002;</p>
<p>&#x63A8;&#x8350;&#x4E0B;&#x8BA9;&#x6211;&#x53D1;&#x751F;&#x8F6C;&#x53D8;&#x7684;&#x6F2B;&#x753B;&#x300A;&#x90A3;&#x5E74;&#x90A3;&#x5154;&#x90A3;&#x4E9B;&#x4E8B;&#x513F;&#x300B;&#xFF0C;&#x6B22;&#x8FCE;&#x5230;&#x767E;&#x5EA6;&#x90A3;&#x5E74;&#x90A3;&#x5154;&#x90A3;&#x4E9B;&#x4E8B;&#x513F;&#x5427;&#x3002;&#x8FD8;&#x6709;&#x5929;&#x6DAF;&#x56FD;&#x89C2;&#x7684;&#x300A;&#x6211;&#x4EEC;&#x7684;&#x5F81;&#x9014;&#x662F;&#x661F;&#x8FB0;&#x5927;&#x6D77;&#x300B;&#x3002;</p>
<p>&#x6211;&#x81EA;&#x8BA4;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x601D;&#x8003;&#x80FD;&#x529B;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x4F9D;&#x7136;&#x88AB;&#x8206;&#x8BBA;&#x6240;&#x5F71;&#x54CD;&#x3002;&#x5373;&#x4F7F;&#x4E2D;&#x56FD;&#x666E;&#x9009;&#x9886;&#x5BFC;&#x4EBA;&#xFF0C;&#x6C11;&#x4F17;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x80FD;&#x529B;&#x8FA8;&#x522B;&#x54EA;&#x4E9B;&#x662F;&#x771F;&#x7684;&#x6709;&#x80FD;&#x529B;&#x7684;&#x9886;&#x5BFC;&#x4E48;&#xFF1F;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6F14;&#x8BF4;&#x5BB6;&#x3002;&#x6C11;&#x4F17;&#x4E5F;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x8FD1;&#x8DDD;&#x79BB;&#x63A5;&#x89E6;&#x5019;&#x9009;&#x4EBA;&#xFF0C;&#x4E86;&#x89E3;&#x5019;&#x9009;&#x4EBA;&#xFF0C;&#x6700;&#x540E;&#x53EA;&#x80FD;&#x88AB;&#x8206;&#x8BBA;&#x6240;&#x5F71;&#x54CD;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x9009;&#x4E0D;&#x8FC7;&#x662F;&#x70E7;&#x94B1;&#x7684;&#x8206;&#x8BBA;&#x6218;&#x3002;&#x666E;&#x9009;&#x9664;&#x4E86;&#x7ED9;&#x4E88;&#x6C11;&#x4F17;&#x80FD;&#x81EA;&#x5DF1;&#x51B3;&#x5B9A;&#x56FD;&#x5BB6;&#x9886;&#x5BFC;&#x4EBA;&#x7684;&#x9519;&#x89C9;&#x4E0E;&#x5FEB;&#x611F;&#xFF0C;&#x6CA1;&#x6709;&#x5B9E;&#x8D28;&#x610F;&#x4E49;&#x3002;&#x6240;&#x800C;&#x56FD;&#x5BB6;&#x7684;&#x96C6;&#x4F53;&#x9886;&#x5BFC;&#x65B9;&#x5F0F;&#xFF0C;&#x515A;&#x5185;&#x7684;&#x9009;&#x62D4;&#x673A;&#x5236;&#x66F4;&#x52A0;&#x5408;&#x7406;&#x3002;&#x65E0;&#x8BBA;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x53EA;&#x8981;&#x80FD;&#x9009;&#x51FA;&#x80FD;&#x5E26;&#x9886;&#x6211;&#x4EEC;&#x8FDB;&#x6B65;&#x7684;&#x9886;&#x5BFC;&#x4EBA;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x5E94;&#x8BE5;&#x5F97;&#x5230;&#x4EBA;&#x6C11;&#x7684;&#x62E5;&#x62A4;&#x3002;&#x666E;&#x9009;&#x4E0D;&#x8FC7;&#x662F;&#x4E00;&#x573A;&#x9A97;&#x5C40;&#x7F62;&#x4E86;&#x3002;&#x653F;&#x6CBB;&#x8FD8;&#x662F;&#x5E94;&#x8BE5;&#x8BA9;&#x7CBE;&#x82F1;&#x6765;&#x73A9;&#x3002;</p>
<p>&#x4E2A;&#x4EBA;&#x5E0C;&#x671B;&#xFF0C;&#x9999;&#x6E2F;&#x80FD;&#x771F;&#x6B63;&#x878D;&#x5165;&#x4E2D;&#x56FD;&#xFF1B;&#x53F0;&#x6E7E;&#x80FD;&#x591F;&#x65E9;&#x65E5;&#x56DE;&#x5F52;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x8981;&#x589E;&#x52A0;&#x7279;&#x6743;&#x9636;&#x7EA7;&#xFF1B;&#x4E2D;&#x56FD;&#x65E9;&#x65E5;&#x590D;&#x5174;&#x3002;</p>
<p>&#x6211;&#x7231;&#x7956;&#x56FD;&#xFF0C;&#x6211;&#x9A84;&#x50B2;&#x3002;</p>
</div><script type="text/javascript" src="/js/share.js?v=0.0.0" async></script><a data-url="http://hongzheng.me/2013/12/24/change_of_myself/" data-id="cit3qzwvb0005nsondsrnzml6" class="article-share-link">Share</a><div class="tags"></div><div class="post-nav"><a href="/2014/01/03/ajaxfileupload_ie8_problems/" class="pre">AjaxFileUpload IE8 problems</a></div></div></div></div><div class="pure-u-1-4 hidden_mid_and_down"><div id="sidebar"><div class="widget"><form action="//www.google.com/search" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="text" name="q" maxlength="20" placeholder="Search"/><input type="hidden" name="sitesearch" value="http://hongzheng.me"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> Categories</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/database/">database</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/linux/">linux</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/web/">web</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/政治与社会/">政治与社会</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/生活/">生活</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> Tags</i></div><div class="tagcloud"><a href="/tags/web/" style="font-size: 15px;">web</a> <a href="/tags/Algorithm/" style="font-size: 15px;">Algorithm</a> <a href="/tags/leetcode/" style="font-size: 15px;">leetcode</a> <a href="/tags/mysql/" style="font-size: 15px;">mysql</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> Recent</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/09/14/need-to-remember/">需要记住的算法</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/09/14/bit-manipulate-summary/">Bit Manipulation 总结</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/09/14/sorting/">Sorting</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/09/14/find-the-difference/">389. Find the Difference</a></li><li class="post-list-item"><a class="post-list-link" href="/2014/11/20/restart_from_hexo/">重新拾起我的博客</a></li><li class="post-list-item"><a class="post-list-link" href="/2014/01/20/vsftp_configuration/">vsftp 配置</a></li><li class="post-list-item"><a class="post-list-link" href="/2014/01/19/digitalocean-mysql/">DigitalOcean mysql无法启动</a></li><li class="post-list-item"><a class="post-list-link" href="/2014/01/19/yum_install_mongodb_nodejs/">用yum安装mongodb, nodejs</a></li><li class="post-list-item"><a class="post-list-link" href="/2014/01/03/ajaxfileupload_ie8_problems/">AjaxFileUpload IE8 problems</a></li><li class="post-list-item"><a class="post-list-link" href="/2013/12/24/change_of_myself/">从一个愤青到自干五</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> Blogroll</i></div><ul></ul><a href="http://www.example1.com/" title="site-name1" target="_blank">site-name1</a><ul></ul><a href="http://www.example2.com/" title="site-name2" target="_blank">site-name2</a><ul></ul><a href="http://www.example3.com/" title="site-name3" target="_blank">site-name3</a></div></div></div><div class="pure-u-1 pure-u-md-3-4"><div id="footer">© <a href="/." rel="nofollow">reStart.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div></div></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/totop.js?v=0.0.0" async></script><script type="text/javascript" src="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.pack.js" async></script><script type="text/javascript" src="/js/fancybox.js?v=0.0.0" async></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>